{
  "id": 230,
  "date": "2019-12-15T11:17:31",
  "date_gmt": "2019-12-15T19:17:31",
  "guid": { "rendered": "https://www.himjobs.com/?page_id=230" },
  "modified": "2020-02-08T17:12:27",
  "modified_gmt": "2020-02-09T01:12:27",
  "slug": "resume-writing-article",
  "status": "publish",
  "type": "page",
  "link": "https://www.himjobs.com/resources/resume-tips/resume-writing-article/",
  "title": { "rendered": "Resume Writing Article" },
  "content": {
    "rendered": "<p>[et_pb_section fb_built=&#8221;1&#8243; admin_label=&#8221;Section&#8221; _builder_version=&#8221;4.0.6&#8243; background_color=&#8221;#eeeeee&#8221; background_image=&#8221;https://www.himjobs.com/wp-content/uploads/2020/02/bkgd-hrd-blue.jpg&#8221; global_module=&#8221;459&#8243; saved_tabs=&#8221;all&#8221;][et_pb_row _builder_version=&#8221;4.0.6&#8243;][et_pb_column type=&#8221;4_4&#8243; _builder_version=&#8221;4.0.6&#8243;][et_pb_text admin_label=&#8221;Resources&#8221; _builder_version=&#8221;4.0.6&#8243; text_font=&#8221;|300||on|||||&#8221; text_font_size=&#8221;40px&#8221; background_layout=&#8221;dark&#8221;]</p>\n<p>Resources</p>\n<p>[/et_pb_text][/et_pb_column][/et_pb_row][/et_pb_section][et_pb_section fb_built=&#8221;1&#8243; _builder_version=&#8221;4.0.6&#8243;][et_pb_row _builder_version=&#8221;4.0.6&#8243;][et_pb_column type=&#8221;4_4&#8243; _builder_version=&#8221;4.0.6&#8243;][et_pb_text _builder_version=&#8221;4.0.6&#8243; hover_enabled=&#8221;0&#8243;]</p>\n<h1>Resume Writing Article</h1>\n<p><em>Your Resume<br /></em><strong>A Check List for Today’s Trends<br /></strong>By: Perry E. Ellie, MA, RHIA, FAHIMA<br />President, H.I.M. Recruiters</p>\n<h3>Does your resume work for you?</h3>\n<p>The bottom line is that you must look good on paper, if you want to interview for the job. As the owner of a health care recruiting firm specializing in Health Information Management, I critique thousands of resumes per year. By employing the common sense concepts in this article you can enhance your resume, find the work of your dreams and change your life.</p>\n<p>Let me begin by stating there is no one correct resume format. We have included one sample resume for reference purposes, but you can take the ideas and concepts presented here and adapt them to meet your own personal needs. You may even choose to compose more than one resume to optimally present your qualifications for employment for different types of positions. Resumes are created to reflect your job history and your own personal style. That’s right, your style, your thoughts and your accomplishments should come alive through the words, format and finishing touches your resume conveys. Your resume must be easy to scan and interesting to read. The challenge to you is to create a resume that contains enough enticing tidbits to achieve the goal of obtaining you an interview.</p>\n<p>In our culture people read from the top down and from left to right. So because the purpose of your resume is to be read, always keep this fact in mind as you write. For example, do not utilize valuable left margin space for dates, move dates to the right margin and use the left for information which will enhance your candidacy. Follow this theme throughout. Start by presenting the area which demonstrates your strongest qualifications. If your strength is your experience, or education or credentials or even volunteer experience; whatever, lead with it and proceed with the top to bottom concept. If your job title is more impressive than the company, list it first. Similarly, if your college is more impressive than the degree, then list it first.</p>\n<h3>How long should your Resume be?</h3>\n<p>The &#8220;acceptable&#8221; length of a resume often creates a fair amount of discussion. Must my resume be only one page? Are three or even four pages too much? Again, a common sense approach should prevail. In most cases, a one-page resume is preferred, unless your qualifications are extensive. The more focused your document is, the more likely it will be read. Strive to never exceed 1-1/2 to 1-3/4 pages. Remember your resume should not read like a job description. You do not need to recreate your entire past history. A resume should stress your qualifications, skills, and achievements instead of your duties and responsibilities.</p>\n<p>There are numerous ways to accomplish the goal of resume brevity and still optimally reflect the depth of your qualifications for an opportunity. Allow us to walk you through a resume line by line, section by section. Remember, every word, every line contributes to the length and to your résumé’s purpose.</p>\n<p>To further make this point, beginning at the very top, the word &#8220;Resume&#8221; is not needed and a waste of space. The style and format of the document indicates its function, so a title is not needed. By this simple change, one line in length is saved for a more valuable message.</p>\n<h3>Getting started:</h3>\n<p>At this point you are still staring at a blank page. Many people have difficulty moving beyond this point into the true content of their resumes. They procrastinate using excuses such as &#8220;I really don’t know where to begin,&#8221; &#8220;I don’t have enough experience, or education, or credentials, or &#8230;,&#8221; they just have a block in getting started.</p>\n<p>We would encourage you to begin with notes and develop them into a rough draft. Think back over your experience and jot down highlights of your life, education and work experience. At this point don’t worry about the exact words or dates, concentrate on your accomplishments. As your record each positive point it should provide you with confidence to proceed.</p>\n<h3>Getting to it:</h3>\n<p>Center your name and contact information at the top of the pageand include any credentials or degrees you may possess. For some reason, which I do not understand, the majority of resumes make you search throughout to determine education and credentials i.e. Perry E. Ellie, MA, RHIA, Fellow AHIMA. Why conceal this information? If you have these types of credentials, use them. If you don’t, or if they are less than ideal for the position you are applying, leave this information for your education section later in the resume. For the vast majority of candidates it is preferable to list your education and credentials up front. Utilize Word to highlight or draw attention to this and other key information in a way to match your own personal style.</p>\n<p>Under you name include your full mailing address, e-mail address, cell phone and home phone numbers if you have them.</p>\n<h3>Do you need an Objective?</h3>\n<p>In my opinion NO! Objective statements are usually written in such general terms that they are useless. Who doesn’t want a position which is &#8220;challenging,&#8221; or has &#8220;growth potential.&#8221; Drop the objective and use this space to further describe your qualifications.</p>\n<p>Sometimes, but rarely, an objective can be beneficial when applying for a certain position. By creating a targeted objective you can zero-in on one opportunity. But even then I would caution that this can be a self-limiting exercise. Because if the position has already been filled your specific objective may eliminate you from consideration for other opportunities which may exist and you are not aware of. Our advice is to stay away from an &#8220;objective statement.&#8221;</p>\n<h3>What’s next?</h3>\n<p>Our recommendation is that the next section of your resume should provide an overview of your career to date. Following a left to right margin line of separation you should have a section titled “Summary”, “Achievements” or “Accomplishments” or a similar word to reflect your style. Bold this and all section title words to draw attention in a cursory review by your reader. This &#8220;Summary&#8221; section should contain your bestselling features. We suggest five bulleted items which begin with action verbs. A selected list of action verbs are listed on this website for your use.</p>\n<p>We further advise that each bullet begin with a different action verb to show your creativity verses the repetitive use of the same word.</p>\n<p>In our sample resume the next section is Experience, so we will address that area next. For you, the next section should be the area which demonstrates your strongest qualification. For students it is often Education, for highly involved volunteers it may be Professional Activities. Our best advice is to write and polish each section. Then you can cut and paste the sections in an optimal sequence for the opportunity you are applying.</p>\n<h3>How do you show your work experience?</h3>\n<p>When sharing your Experience, always begin with your most recent position. Share the name of your employer, city, state and ideally some brief information about the company. As in our sample, &#8220;500 bed, non-profit, teaching hospital, managed 40 FTE.&#8221; This allows the reader to zero-in and qualify your experience. But we often receive resumes that require us to research the employer to determine if they are a 50 bed or a thousand bed operation; a Fortune 500 firm or an entrepreneurial start-up. Some candidates believe that sharing that they work in a 100 bed facility may eliminate them from consideration for larger facilities. Certainly this possibility exists. We maintain that sharing an incomplete background requires extra effort by the employer to determine your full employment history and that this &#8220;extra effort&#8221; may result in the employer moving on to the next resume where all needed information is provided. We often encounter resumes where the writer seems to assume that everyone knows that &#8220;Major Medical Center&#8221; is a large, teaching hospital in Largo, Florida. Please remember that as you e-mail your resume around the country or the world, that your reader is likely to be totally unfamiliar with the particulars of your employers. Share this information in a cursory manner so you may be matched to future opportunities that optimally complement your experience to date.</p>\n<p>Next in the Experience section, for each employer, include your job title. If you were promoted by this employer, list your final position and list this accomplishment as one of your bullets. Dates should be included on the right-hand margin in a summary fashion. Our sample includes dates in a year-to-year format to simplify presentation. You may choose a month and year format, but please do not include specific dates. Obviously, dates of employment are needed, but how specific you are is up to you. Specificity of dates highlights gaps in employment and appropriately raises questions. Always be totally honest when sharing dates and all resume information. However, the year-to-year format will likely provide you with a more personal opportunity to explain any potential breaks in employment. Make sure that your dates make sense! We often see overlapping dates that create confusion and question. If you have held multiple positions at the same time, explain this in a clear concise way on your resume or in a cover letter.</p>\n<p>When listing your work experience it is generally not necessary to go back more than about thirty years. If you have been with the same employer for over thirty years, then it is logical to list your previous position. On our sample resume we included the line, &#8220;Several Other Progressive Health Information Management Positions 1977-1982,&#8221; to summarize this prior period. Remember, this is a suggestion to condense the length of your resume. You may choose to share additional experience if you feel it is pertinent to the opportunity you are seeking. Generally however, any experience from over thirty years ago is outdated and a misuse of valuable resume space.</p>\n<p>Under each employer, position title, and time frame you should include a brief paragraph or a few bullets highlighting your experience. Again utilize action verbs and statements. Include facts to authenticate results. For example, &#8220;Enhanced DRG reimbursement by increasing case-mix from 1.21 to 1.53.&#8221; List all your employment in a reverse chronological format. Be factual and creative, your resume is a critical marketing tool!</p>\n<h3>What is important when sharing your Education and Credentials?</h3>\n<p>We stress that it is critical to share your Education and Credentials in an accurate and complete fashion. When listing education, list your highest degree achieved first. Follow this with lesser degrees and credentials. Share your degree (i.e., MA, BS, AS), the year it was achieved (Only if in the last twenty years to avoid age discrimination), the University or college and its location (city, state). For example, &#8220;M.A., Health Care Administration, 1993, Central Michigan University, Mount Pleasant, MI.&#8221; If you have college courses but no degree; list this in a summary form. Be careful not to misrepresent yourself with the written perception of a degree. It is common to see a college and year listed, with no indication of whether this represents a degree or just coursework towards a degree.</p>\n<h3>Why your credentials should be included!</h3>\n<p>Often neglected on a large percentage of the resumes we receive are credentials. Most resumes logically indicate degrees in Health Information Technology or Management, but do not indicate credentials. As shown in our sample resume, &#8220;Registered Health Information Administrator, 1988.&#8221; Many H.I.M. professionals seem to think that listing a degree automatically represents the RHIT or RHIA credential. This is simply not true. Each year only about 70% of those eligible pass the accreditation and registration exams. The 30% who do not, still indicate their degrees on their resumes. The only distinction potential employers can make on a resume is whether or not the credential is included. We encourage you to write your resume for your reader. Include the year your credential was achieved as proof to your success. This information will also facilitate credential verification in the employment screening process. Our firm has noted an increasing trend of degree and credential falsification. Verification of backgrounds is an ever increasing need in today’s society.</p>\n<h3>Are volunteer professional activities remarkable?</h3>\n<p>Absolutely! Experience as a professional volunteer demonstrates leadership, networking and a professional commitment. You may choose to call the section “Professional Affiliations”, “Activities” or choose to not include it at all. In our sample we included activities at a national, state or local level. If this is appropriate for you, do the same. If you have professional leadership experience in your work group, department or facility share this information with your reader. Recall any awards or special recognition’s you may have received and include them here. This is also an appropriate area to include publications or presentations. Please recall however that resume length is a key issue. If you have extensive professional activities, you will need to summarize and maintain a separate list of accomplishments to be shared upon request. Detailed lists of this nature are appropriate in a Curriculum Vitae (C.V.) format. A C.V. is basically an extended resume with full detail in the area of professional involvement, publications and speaking engagements. Professional sections are certainly not limited to Health Information Management activities and you should feel free to include other professional associations where you are active. This may include anything from HIMSS (Healthcare Information and Management Systems Society) to the American Cancer Society. In our sample resume we attempted to show both leadership and membership roles. We also chose to include some important dates and to exclude others. Utilize your judgment to determine your optimal presentation in this area.</p>\n<h3>Should you include a Personal section?</h3>\n<p>Rarely, information such as your marital status, age, weight, height, hobbies and interests generally have minimal relevance to your qualifications for a position. In fact, we could make a strong argument that this information can work against you. Although it is illegal to discriminate for a litany of reasons, it occurs constantly. Your prospective employer may not like thin and tall people, they may prefer married employees, they may not enjoy the outdoors or stamp collecting. We advise against sharing this information because it may trigger a conscious or even an unconscious bias in the hiring authority.</p>\n<p>In limited situations we have identified advantages to including selective personal information. For example, if you are an older candidate, you might desire to show vitality by citing sports and travel activities; a sales professional may indicate unmarried status combined with a willingness to travel and/or relocate. It is also generally advisable for students to utilize a personal section. This information often compensates for an understandable lack of professional experience, and at the same time, communicates that you are a well-rounded, active, interesting candidate. It may also serve to provide an ice-breaker for an interview.</p>\n<h3>Why students face a special challenge.</h3>\n<p>The common scenario of minimal of work experience needs to be overcome to create an eye-catching, personalized and informative resume. This drawback can be minimized by emphasizing the many strengths which students have.</p>\n<p>In addition to energy and enthusiasm, students should draw attention to academic excellence, volunteer work, leadership roles, internships, computer expertise, previous employment experience, ability to travel or relocate, foreign language skills, and any other attributes of this type that may apply.</p>\n<h3>Do you include references in your resume?</h3>\n<p>No, reference information should be kept on a separate sheet of paper from your resume. In fact, the statement &#8220;References will be furnished upon request&#8221; is again wasted space that can be utilized to share your actual qualifications for a position. Candidates seriously under consideration will be required to furnish references, and it is assumed that they are available.</p>\n<p>When creating your sheet of references we recommend that they are professional references and are previous supervisors or employers. Include the person’s name, title, telephone number and your working relationship to them. We typically check three references, but prefer five to be listed as options should some references be unavailable. For your best presentation, it is wise to insure that each of your references is positive. We often encounter candidate supplied references which are far from enthusiastic about a candidate in review.</p>\n<h3>What are finishing touches?</h3>\n<p>They are the distinctions that make your resume stand out and are best added to your resume at the conclusion of the content design process. It involves utilizing different fonts, sizes (12 point recommended), bolding, italicising, bulleting, and line/margin adjusters to determine the optimal look for you.</p>\n<p>In considering your résumé’s overall presentation, remember that &#8220;less is more.&#8221; Surround your best qualifications with empty or &#8220;white space&#8221; to draw attention. In other words, it is more effective to present a few easy-to-read highlights than to cram a lot of information onto a page.</p>\n<p>[/et_pb_text][/et_pb_column][/et_pb_row][/et_pb_section][et_pb_section fb_built=&#8221;1&#8243; _builder_version=&#8221;4.0.6&#8243; background_color=&#8221;#82be5a&#8221; custom_padding=&#8221;0px||0px||false|false&#8221; global_module=&#8221;572&#8243;][et_pb_row _builder_version=&#8221;4.0.6&#8243;][et_pb_column type=&#8221;4_4&#8243; _builder_version=&#8221;4.0.6&#8243;][et_pb_cta title=&#8221;Start Your Job Search&#8221; button_url=&#8221;https://www.himjobs.com/search-jobs/&#8221; button_text=&#8221;Search Jobs&#8221; _builder_version=&#8221;4.0.6&#8243; background_enable_color=&#8221;off&#8221;]</p>\n<p>View all of the HIM job opportunities available now.</p>\n<p>[/et_pb_cta][/et_pb_column][/et_pb_row][/et_pb_section]</p>\n",
    "protected": false
  },
  "excerpt": {
    "rendered": "<p>[et_pb_section fb_built=&#8221;1&#8243; admin_label=&#8221;Section&#8221; _builder_version=&#8221;4.0.6&#8243; background_color=&#8221;#eeeeee&#8221; background_image=&#8221;https://www.himjobs.com/wp-content/uploads/2020/02/bkgd-hrd-blue.jpg&#8221; global_module=&#8221;459&#8243; saved_tabs=&#8221;all&#8221;][et_pb_row _builder_version=&#8221;4.0.6&#8243;][et_pb_column type=&#8221;4_4&#8243; _builder_version=&#8221;4.0.6&#8243;][et_pb_text admin_label=&#8221;Resources&#8221; _builder_version=&#8221;4.0.6&#8243; text_font=&#8221;|300||on|||||&#8221; text_font_size=&#8221;40px&#8221; background_layout=&#8221;dark&#8221;] Resources [/et_pb_text][/et_pb_column][/et_pb_row][/et_pb_section][et_pb_section fb_built=&#8221;1&#8243; _builder_version=&#8221;4.0.6&#8243;][et_pb_row _builder_version=&#8221;4.0.6&#8243;][et_pb_column type=&#8221;4_4&#8243; _builder_version=&#8221;4.0.6&#8243;][et_pb_text _builder_version=&#8221;4.0.6&#8243; hover_enabled=&#8221;0&#8243;] Resume Writing Article Your ResumeA Check List for Today’s TrendsBy: Perry E. Ellie, MA, RHIA, FAHIMAPresident, H.I.M. Recruiters Does your resume work for you? The bottom line is that you must [&hellip;]</p>\n",
    "protected": false
  },
  "author": 1,
  "featured_media": 0,
  "parent": 215,
  "menu_order": 0,
  "comment_status": "closed",
  "ping_status": "closed",
  "template": "",
  "meta": {
    "_et_pb_use_builder": "on",
    "_et_pb_old_content": "",
    "_et_gb_content_width": ""
  },
  "_links": {
    "self": [{ "href": "https://www.himjobs.com/wp-json/wp/v2/pages/230" }],
    "collection": [{ "href": "https://www.himjobs.com/wp-json/wp/v2/pages" }],
    "about": [{ "href": "https://www.himjobs.com/wp-json/wp/v2/types/page" }],
    "author": [
      {
        "embeddable": true,
        "href": "https://www.himjobs.com/wp-json/wp/v2/users/1"
      }
    ],
    "replies": [
      {
        "embeddable": true,
        "href": "https://www.himjobs.com/wp-json/wp/v2/comments?post=230"
      }
    ],
    "version-history": [
      {
        "count": 4,
        "href": "https://www.himjobs.com/wp-json/wp/v2/pages/230/revisions"
      }
    ],
    "predecessor-version": [
      {
        "id": 646,
        "href": "https://www.himjobs.com/wp-json/wp/v2/pages/230/revisions/646"
      }
    ],
    "up": [
      {
        "embeddable": true,
        "href": "https://www.himjobs.com/wp-json/wp/v2/pages/215"
      }
    ],
    "wp:attachment": [
      { "href": "https://www.himjobs.com/wp-json/wp/v2/media?parent=230" }
    ],
    "curies": [
      { "name": "wp", "href": "https://api.w.org/{rel}", "templated": true }
    ]
  }
}
