{
  "id": 235,
  "date": "2019-12-15T11:19:41",
  "date_gmt": "2019-12-15T19:19:41",
  "guid": { "rendered": "https://www.himjobs.com/?page_id=235" },
  "modified": "2020-02-08T17:15:57",
  "modified_gmt": "2020-02-09T01:15:57",
  "slug": "references",
  "status": "publish",
  "type": "page",
  "link": "https://www.himjobs.com/resources/resume-tips/references/",
  "title": { "rendered": "References" },
  "content": {
    "rendered": "<p>[et_pb_section fb_built=&#8221;1&#8243; admin_label=&#8221;Section&#8221; _builder_version=&#8221;4.0.6&#8243; background_color=&#8221;#eeeeee&#8221; background_image=&#8221;https://www.himjobs.com/wp-content/uploads/2020/02/bkgd-hrd-blue.jpg&#8221; global_module=&#8221;459&#8243; saved_tabs=&#8221;all&#8221;][et_pb_row _builder_version=&#8221;4.0.6&#8243;][et_pb_column type=&#8221;4_4&#8243; _builder_version=&#8221;4.0.6&#8243;][et_pb_text admin_label=&#8221;Resources&#8221; _builder_version=&#8221;4.0.6&#8243; text_font=&#8221;|300||on|||||&#8221; text_font_size=&#8221;40px&#8221; background_layout=&#8221;dark&#8221;]</p>\n<p>Resources</p>\n<p>[/et_pb_text][/et_pb_column][/et_pb_row][/et_pb_section][et_pb_section fb_built=&#8221;1&#8243; _builder_version=&#8221;4.0.6&#8243;][et_pb_row _builder_version=&#8221;4.0.6&#8243;][et_pb_column type=&#8221;4_4&#8243; _builder_version=&#8221;4.0.6&#8243;][et_pb_text _builder_version=&#8221;4.0.6&#8243; hover_enabled=&#8221;0&#8243;]</p>\n<h1>References</h1>\n<p>In a competitive job market, where many qualified candidates are competing, most recognize that all aspects of one’s approach to a company should be in order, such as initial cover letters and resumes, interview preparations and so on. But many job seekers don’t think quite far enough ahead, and inadvertently leave out one important step—coaching their references to help them.</p>\n<p>Any job seeker’s ultimate goal is to demonstrate the truth of his or her image as a competent professional who will fit into the company and continue to work as well in the future as in the past. Because the company may probe references deeply on both competence and fit, references should be selected on the basis of close knowledge of the candidate’s professional background and the ability to give an articulate, enthusiastic presentation of the candidate.<br />References should come from the ranks of workplace associates. Former supervisors and professional colleagues are usually considered first, but customers and subordinates can also be effective references. The higher the rank, the more weight the reference will carry. References should be able to provide specific knowledge of the candidate and familiarity with the job seeker’s recent accomplishments, background and experience.</p>\n<h3>Probe Your References</h3>\n<p>As a job seeker, remember you are enlisting members of your team. Select carefully, favouring people who can say positive things about your work, and always ask your references for permission to list them. If you have any doubt about their commitment to you, ask if they can recommend you and discuss what they might say.</p>\n<p>In an article in the National Business Employment Weekly, Tom Camden shared the case of a man who simply assumed that his ex-boss, who had provided &#8220;expensive outplacement counsel and encouragement,&#8221; would supply a good recommendation. A year later, the man found out that his ex-boss had torpedoed several &#8220;almost&#8221; job offers.</p>\n<p>If your reason for leaving a company was less than positive, a frank discussion of what can be said on your behalf will be necessary. Ask for a letter of reference and volunteer to help draft it. Agree on a statement that does not reflect negatively on either party and try to get an emphasis on your strengths and qualifications. Tom Washington, author of The Hunt: Complete Guide to Effective Job Finding, says &#8220;If you can get your former boss to say positive things in a letter, the person will almost certainly say positive things when called by prospective employers.&#8221; You also may formulate a list of questions you anticipate from interviewers and give them, along with your answers, to your references.</p>\n<p>Having a frank discussion with your own references will give you an opportunity to gently probe for areas of weakness your references see in you. If you find areas of hesitation, you need to discuss whether they can support you without reservation. If not, you must determine if certain areas can be skirted or decide you need to find another reference.</p>\n<h3>Brief Your References</h3>\n<p>Give all your references a copy of your resume, describe the kinds of positions you are targeting, and fill them in on your recent related activities. While it is common to offer three references, the best prepared job seekers usually can offer a total of five. Some references may simply be more appropriate to deal with certain companies or industries. Often, one reference may not be available for an extended period (on vacation) and others will need to be contacted.</p>\n<p>As much as possible, YOU want to manage the contact background checkers will have with your references. A savvy recruiter will ask your references to suggest other people for them to interview. You can give your references the names of other references you are using. That way, recruiters will be referred to people you have chosen and will be more likely to stay within the loop you have defined.</p>\n<p>Retain your list of references until requested. Normally, references are not requested until after an interview. You can bring a reference list along with you to the interview, but do not offer it unless asked.</p>\n<p>Immediately after each interview or submitting your references to a firm, if you have not done so already, send a copy of the job description to your references and include a note regarding the aspects of your background which generated the most interest during the interview. If time is of the essence, call your references, describe the company, the job, the interview, and remind them of your qualifications that fit the job. This degree of preparation will not only help your references organize their thoughts, it will impress them with your thoroughness.</p>\n<p>In addition to these excellent tips, we would suggest a couple of additional &#8220;to do’s&#8221; on the subject:</p>\n<ol>\n<li>Early in your job search, brainstorm to develop a detailed, deep list of potential references. For each position you have held, develop a list of both supervisors and co-workers. For current and recent assignments also be prepared to give names of subordinates. When selecting your reference team, make sure to have current phone numbers for each contact. If the references you are using have left the company, make sure to include their current addresses and, as a matter of courtesy, make sure to ask their permission to use them as references.</li>\n<li>Have your references checked. There is nothing worse than that gnawing feeling you get wondering what your references will say about you. Why not get rid of it once and for all? You can hire a reference checking firm that will give you a report on what each of your references has to say. Some of our candidates have used a reference checking firm for this purpose.</li>\n</ol>\n<p>[/et_pb_text][/et_pb_column][/et_pb_row][/et_pb_section][et_pb_section fb_built=&#8221;1&#8243; _builder_version=&#8221;4.0.6&#8243; background_color=&#8221;#82be5a&#8221; custom_padding=&#8221;0px||0px||false|false&#8221; global_module=&#8221;572&#8243;][et_pb_row _builder_version=&#8221;4.0.6&#8243;][et_pb_column type=&#8221;4_4&#8243; _builder_version=&#8221;4.0.6&#8243;][et_pb_cta title=&#8221;Start Your Job Search&#8221; button_url=&#8221;https://www.himjobs.com/search-jobs/&#8221; button_text=&#8221;Search Jobs&#8221; _builder_version=&#8221;4.0.6&#8243; background_enable_color=&#8221;off&#8221;]</p>\n<p>View all of the HIM job opportunities available now.</p>\n<p>[/et_pb_cta][/et_pb_column][/et_pb_row][/et_pb_section]</p>\n",
    "protected": false
  },
  "excerpt": {
    "rendered": "<p>[et_pb_section fb_built=&#8221;1&#8243; admin_label=&#8221;Section&#8221; _builder_version=&#8221;4.0.6&#8243; background_color=&#8221;#eeeeee&#8221; background_image=&#8221;https://www.himjobs.com/wp-content/uploads/2020/02/bkgd-hrd-blue.jpg&#8221; global_module=&#8221;459&#8243; saved_tabs=&#8221;all&#8221;][et_pb_row _builder_version=&#8221;4.0.6&#8243;][et_pb_column type=&#8221;4_4&#8243; _builder_version=&#8221;4.0.6&#8243;][et_pb_text admin_label=&#8221;Resources&#8221; _builder_version=&#8221;4.0.6&#8243; text_font=&#8221;|300||on|||||&#8221; text_font_size=&#8221;40px&#8221; background_layout=&#8221;dark&#8221;] Resources [/et_pb_text][/et_pb_column][/et_pb_row][/et_pb_section][et_pb_section fb_built=&#8221;1&#8243; _builder_version=&#8221;4.0.6&#8243;][et_pb_row _builder_version=&#8221;4.0.6&#8243;][et_pb_column type=&#8221;4_4&#8243; _builder_version=&#8221;4.0.6&#8243;][et_pb_text _builder_version=&#8221;4.0.6&#8243; hover_enabled=&#8221;0&#8243;] References In a competitive job market, where many qualified candidates are competing, most recognize that all aspects of one’s approach to a company should be in order, such as initial [&hellip;]</p>\n",
    "protected": false
  },
  "author": 1,
  "featured_media": 0,
  "parent": 215,
  "menu_order": 0,
  "comment_status": "closed",
  "ping_status": "closed",
  "template": "",
  "meta": {
    "_et_pb_use_builder": "on",
    "_et_pb_old_content": "",
    "_et_gb_content_width": ""
  },
  "_links": {
    "self": [{ "href": "https://www.himjobs.com/wp-json/wp/v2/pages/235" }],
    "collection": [{ "href": "https://www.himjobs.com/wp-json/wp/v2/pages" }],
    "about": [{ "href": "https://www.himjobs.com/wp-json/wp/v2/types/page" }],
    "author": [
      {
        "embeddable": true,
        "href": "https://www.himjobs.com/wp-json/wp/v2/users/1"
      }
    ],
    "replies": [
      {
        "embeddable": true,
        "href": "https://www.himjobs.com/wp-json/wp/v2/comments?post=235"
      }
    ],
    "version-history": [
      {
        "count": 6,
        "href": "https://www.himjobs.com/wp-json/wp/v2/pages/235/revisions"
      }
    ],
    "predecessor-version": [
      {
        "id": 651,
        "href": "https://www.himjobs.com/wp-json/wp/v2/pages/235/revisions/651"
      }
    ],
    "up": [
      {
        "embeddable": true,
        "href": "https://www.himjobs.com/wp-json/wp/v2/pages/215"
      }
    ],
    "wp:attachment": [
      { "href": "https://www.himjobs.com/wp-json/wp/v2/media?parent=235" }
    ],
    "curies": [
      { "name": "wp", "href": "https://api.w.org/{rel}", "templated": true }
    ]
  }
}
