{
  "id": 300,
  "date": "2019-12-15T12:29:23",
  "date_gmt": "2019-12-15T20:29:23",
  "guid": { "rendered": "https://www.himjobs.com/?page_id=300" },
  "modified": "2020-03-12T09:53:15",
  "modified_gmt": "2020-03-12T16:53:15",
  "slug": "after-the-interview",
  "status": "publish",
  "type": "page",
  "link": "https://www.himjobs.com/resources/after-the-interview/",
  "title": { "rendered": "After the Interview" },
  "content": {
    "rendered": "<p>[et_pb_section fb_built=&#8221;1&#8243; admin_label=&#8221;Section&#8221; _builder_version=&#8221;4.0.6&#8243; background_color=&#8221;#eeeeee&#8221; background_image=&#8221;https://www.himjobs.com/wp-content/uploads/2020/02/bkgd-hrd-blue.jpg&#8221; global_module=&#8221;459&#8243; saved_tabs=&#8221;all&#8221;][et_pb_row _builder_version=&#8221;4.0.6&#8243;][et_pb_column type=&#8221;4_4&#8243; _builder_version=&#8221;4.0.6&#8243;][et_pb_text admin_label=&#8221;Resources&#8221; _builder_version=&#8221;4.0.6&#8243; text_font=&#8221;|300||on|||||&#8221; text_font_size=&#8221;40px&#8221; background_layout=&#8221;dark&#8221;]</p>\n<p>Resources</p>\n<p>[/et_pb_text][/et_pb_column][/et_pb_row][/et_pb_section][et_pb_section fb_built=&#8221;1&#8243; _builder_version=&#8221;4.0.6&#8243;][et_pb_row _builder_version=&#8221;4.0.6&#8243;][et_pb_column type=&#8221;4_4&#8243; _builder_version=&#8221;4.0.6&#8243;][et_pb_text admin_label=&#8221;After the Interview&#8221; _builder_version=&#8221;4.3.2&#8243;]</p>\n<h1>After the Interview</h1>\n<p>Sending a personalized thank you note goes much farther than most people realize. It shows that you&#8217;re willing to &#8220;go above and beyond&#8221; and it also serves as a reminder of your candidacy. It is advisable to send your note via email to ensure that your interviewer receives it in time. Time is of the essence!</p>\n<p>Your thank you note should address these points:</p>\n<ul>\n<li>Thank them again for their time</li>\n<li>Express your ongoing interest in the position</li>\n<li>Follow-up on any key points that you feel a strong need to do so</li>\n<li>Share your availability for future steps</li>\n</ul>\n<p>Keep in mind that thank you letters should be short (no more than six to 10 sentences), so be as concise as possible.</p>\n<h3>Additional Follow-up</h3>\n<p>If you tell the interviewer you&#8217;ll send a list of references or any other information tomorrow morning, make sure you do it. Keeping your word and answering requests in a timely manner speaks volumes about the type of employee you might be.</p>\n<h3>Know When to Sit Tight</h3>\n<p>If an interviewer requests that you follow up by phone in a week, respect her wishes. Calling the next day can be construed as pushy and desperate.</p>\n<h3>Keep Thinking and Learning about the Company</h3>\n<p>Be prepared for additional interviews or follow-up phone calls by continuing to research the organization and the field. Gain new information about a topic brought up in conversation. Think of additional questions you&#8217;d like answered. These actions show the employer that you didn&#8217;t stop caring about the company after the interview was over.</p>\n<h3>Networking</h3>\n<p>Networking should never stop. If you have contacts and connections with anyone who might influence the hiring decision, or who actually knows the interviewer, ask them to put a good word in for you.</p>\n<h3>Accept Rejection with Grace</h3>\n<p>Finally, keep emotions in check and don&#8217;t burn bridges if someone else gets hired. One never knows what the future might hold. The accepted candidate may not work out, or a different opportunity may open up.</p>\n<p>[/et_pb_text][et_pb_text admin_label=&#8221;Letters of Offer&#8221; _builder_version=&#8221;4.3.2&#8243;]</p>\n<h1>Letters of Offer</h1>\n<p>After a successful interview process a verbal offer is commonly followed by a written offer letter.</p>\n<p>These letters should contain the title of the position being offered, the salary, clarification of relocation assistance, sign-on bonuses, benefits, and other specifics of the opportunity.</p>\n<p>This letter will usually include the anticipated start date and contingencies, like passing an employer’s physical exam. If non-compete contracts are to be signed as a condition of employment, make sure you review it prior to accepting opportunity.</p>\n<p>It is good practice to delay a formal resignation from your current position until you have received an offer letter.[/et_pb_text][et_pb_text admin_label=&#8221;Letter of Resignation&#8221; _builder_version=&#8221;4.3.2&#8243;]</p>\n<h2>Letter of Resignation</h2>\n<p>It is up to you to end your relationship as professionally as you began it. Write a letter that expresses your thanks for the opportunity to progress in your career and to respect your decision to resign. Put it in your own words and either mail it personally or hand it to your immediate supervisor. Be pleasant, but firm in sharing your decision.</p>\n<h3>Sample Resignation Letter</h3>\n<p>Date:<br />Company Official<br />Company<br />Address<br />City, State, Zip</p>\n<p>Dear _________________,</p>\n<p>Effective ___________(date), I will be leaving the organization (give a 2 to 4 week notice* and specify the dates and time frames). I will respect guidelines of my non-compete agreement (if applicable).</p>\n<p>I want to thank you in advance for respecting my professional judgement in this matter. I greatly appreciate your cooperation and ask that you avoid any attempts to change my decision.</p>\n<p>Sincerely,<br />(Signature)</p>\n<p>* Two weeks is generally adequate notice for clerical and coding roles. Three weeks may be appropriate for a supervisory role and four weeks (thirty days) may be necessary for a management role.</p>\n<p>[/et_pb_text][et_pb_text admin_label=&#8221;Counteroffers&#8221; _builder_version=&#8221;4.3.2&#8243; hover_enabled=&#8221;0&#8243;]</p>\n<h2>Counteroffers</h2>\n<p>After you have resigned, your employer may come forward with a counteroffer. You then need to ask yourself, which opportunity holds the most real potential? Probably, the new one, or you would not have already been making an effort to leave.</p>\n<div id=\"maininner\" class=\"grid-box\">\n<section id=\"content\" class=\"grid-block\">\n<div id=\"system\">\n<article class=\"item\">\n<div class=\"content clearfix\">\n<h3>The &#8220;Emotion&#8221; of a Counteroffer</h3>\n<p>You are considering a change because your present position and/or company doesn’t offer the potential for growth you seek. You have looked at your decision to change both logically and emotionally, and it’s the emotional decision that is the hardest. That old axiom, &#8220;don’t let your heart rule your mind&#8221; is much easier to say than do. But the fact remains, your needs are not being satisfied! Sure, the company has helped you progress professionally; sure, you’ve made many new friends; and you probably feel comfortable because you can handle the job well. However, as certain as you’re reading this, your objectives and goals are secondary to those of the company, and it will always remain that way. As soon as you thought about changing jobs, subconsciously you knew this was true. <a href=\"https://www.himjobs.com/resources/after-the-interview/the-emotion-of-a-counteroffer/\">› More</a></p>\n<h3>Twelve Factors to Consider</h3>\n<ol>\n<li>Counteroffers are made so you leave an organization on the employers’ terms, not yours.</li>\n<li>What type of company do you work for if you have to threaten to resign before they give you what you are worth.</li>\n<li>Where is the money for the counteroffer coming from? Is it your next raise early? All companies have strict wage and salary guidelines, which must be followed.</li>\n<li>Your company may immediately start looking for a new person at a cheaper price to replace you.</li>\n<li>You have now made your employer aware that you are unhappy. From this day on, your loyalty will always be in question.</li>\n<li>When promotion time comes around, your employer will remember who was loyal, and who wasn’t.</li>\n<li>When times get tough, your employer will begin the cutback with you.</li>\n<li>The same circumstances that now cause you to consider a change will repeat themselves in the future; even if you accept a counteroffer.</li>\n<li>Statistics show that if you accept a counteroffer, the probability of voluntarily leaving in six months or being let go within one year is roughly 80%.</li>\n<li>About 50% of candidates that accept a counteroffer begin a new search within 90 days.</li>\n<li>Accepting a counteroffer is an insult to your intelligence and a blow to your personal pride; knowing that you were bought.</li>\n<li>Once the word gets out, the relationship that you now enjoy with your co-workers will never be the same. You will lose the personal satisfaction of peer group acceptance.</li>\n</ol>\n</div>\n</article>\n</div>\n</section>\n</div>\n<p>[/et_pb_text][et_pb_text admin_label=&#8221;Pre-employment Physical Exams&#8221; _builder_version=&#8221;4.3.2&#8243;]</p>\n<h1>Pre-employment Physical Exams</h1>\n<p>It is fairly routine that offers of employment are contingent on your voluntarily taking and passing a physical exam/drug screening.<br />Always be honest in the application and physical exam process.</p>\n<p>When you take your pre-employment physical, you should consider not taking any non-prescription medication 48 hours prior to the examination. In the event you take some medication prior to the physical, be sure to list all drugs taken prior to the physical and advise the examiner.</p>\n<p>Some over-the-counter products can produce positive drug-test results. Among them: Alka-Seltzer Plus, Allerest, Bronkaid, Contact, Donnagel, Nyquil, Primatene, Sinus Excedrin Extra Strength Caplets, Sudafed and Triaminic.</p>\n<p>Please be advised that alcohol is considered a drug. Marijuana and other illegal substances will show up for a period of thirty days. Any evidence of these substances will result in termination of the hiring process.</p>\n<p>[/et_pb_text][et_pb_text admin_label=&#8221;Relocation/Salary Calculation&#8221; _builder_version=&#8221;4.3.2&#8243;]</p>\n<div class=\"et_pb_column et_pb_column_4_4 et_pb_column_1  et_pb_css_mix_blend_mode_passthrough et-last-child\">\n<div class=\"et_pb_module et_pb_text et_pb_text_1 et_pb_bg_layout_light  et_pb_text_align_left\">\n<div class=\"et_pb_text_inner\">\n<h1>Relocation/Salary Calculation</h1>\n<p>In a relocation situation we negotiate a relocation package with the employer whenever possible. At times no assistance is available, but generally several thousand dollars may be utilized towards relocation. Each employer has a different procedure for fund distribution. Ranging from a sign-on bonus to only receipted expenses being reimbursed.</p>\n<p>To assist you relocation and performing salary comparisons (city to city) we recommend the following site:</p>\n<p><a href=\"http://www.homefair.com\">Homefair.com</a></p>\n<p>This site includes information on apartment and home hunting, evaluating schools, contacting movers, etc…</p>\n</div>\n</div>\n</div>\n<p>[/et_pb_text][/et_pb_column][/et_pb_row][/et_pb_section][et_pb_section fb_built=&#8221;1&#8243; _builder_version=&#8221;4.3.2&#8243; background_color=&#8221;#82be5a&#8221; background_image=&#8221;https://www.himjobs.com/wp-content/uploads/2020/02/cta-bkgd.jpg&#8221; custom_padding=&#8221;0px||0px||false|false&#8221; global_module=&#8221;572&#8243;][et_pb_row _builder_version=&#8221;4.0.6&#8243;][et_pb_column type=&#8221;4_4&#8243; _builder_version=&#8221;4.0.6&#8243;][et_pb_cta title=&#8221;Start Your Job Search&#8221; button_url=&#8221;https://www.himjobs.com/search-jobs/&#8221; button_text=&#8221;Search Jobs&#8221; _builder_version=&#8221;4.0.6&#8243; background_enable_color=&#8221;off&#8221;]</p>\n<p>View all of the HIM job opportunities available now.</p>\n<p>[/et_pb_cta][/et_pb_column][/et_pb_row][/et_pb_section]</p>\n",
    "protected": false
  },
  "excerpt": {
    "rendered": "<p>[et_pb_section fb_built=&#8221;1&#8243; admin_label=&#8221;Section&#8221; _builder_version=&#8221;4.0.6&#8243; background_color=&#8221;#eeeeee&#8221; background_image=&#8221;https://www.himjobs.com/wp-content/uploads/2020/02/bkgd-hrd-blue.jpg&#8221; global_module=&#8221;459&#8243; saved_tabs=&#8221;all&#8221;][et_pb_row _builder_version=&#8221;4.0.6&#8243;][et_pb_column type=&#8221;4_4&#8243; _builder_version=&#8221;4.0.6&#8243;][et_pb_text admin_label=&#8221;Resources&#8221; _builder_version=&#8221;4.0.6&#8243; text_font=&#8221;|300||on|||||&#8221; text_font_size=&#8221;40px&#8221; background_layout=&#8221;dark&#8221;] Resources [/et_pb_text][/et_pb_column][/et_pb_row][/et_pb_section][et_pb_section fb_built=&#8221;1&#8243; _builder_version=&#8221;4.0.6&#8243;][et_pb_row _builder_version=&#8221;4.0.6&#8243;][et_pb_column type=&#8221;4_4&#8243; _builder_version=&#8221;4.0.6&#8243;][et_pb_text admin_label=&#8221;After the Interview&#8221; _builder_version=&#8221;4.3.2&#8243;] After the Interview Sending a personalized thank you note goes much farther than most people realize. It shows that you&#8217;re willing to &#8220;go above and beyond&#8221; and it [&hellip;]</p>\n",
    "protected": false
  },
  "author": 1,
  "featured_media": 0,
  "parent": 35,
  "menu_order": 0,
  "comment_status": "closed",
  "ping_status": "closed",
  "template": "",
  "meta": {
    "_et_pb_use_builder": "on",
    "_et_pb_old_content": "",
    "_et_gb_content_width": ""
  },
  "_links": {
    "self": [{ "href": "https://www.himjobs.com/wp-json/wp/v2/pages/300" }],
    "collection": [{ "href": "https://www.himjobs.com/wp-json/wp/v2/pages" }],
    "about": [{ "href": "https://www.himjobs.com/wp-json/wp/v2/types/page" }],
    "author": [
      {
        "embeddable": true,
        "href": "https://www.himjobs.com/wp-json/wp/v2/users/1"
      }
    ],
    "replies": [
      {
        "embeddable": true,
        "href": "https://www.himjobs.com/wp-json/wp/v2/comments?post=300"
      }
    ],
    "version-history": [
      {
        "count": 12,
        "href": "https://www.himjobs.com/wp-json/wp/v2/pages/300/revisions"
      }
    ],
    "predecessor-version": [
      {
        "id": 928,
        "href": "https://www.himjobs.com/wp-json/wp/v2/pages/300/revisions/928"
      }
    ],
    "up": [
      {
        "embeddable": true,
        "href": "https://www.himjobs.com/wp-json/wp/v2/pages/35"
      }
    ],
    "wp:attachment": [
      { "href": "https://www.himjobs.com/wp-json/wp/v2/media?parent=300" }
    ],
    "curies": [
      { "name": "wp", "href": "https://api.w.org/{rel}", "templated": true }
    ]
  }
}
